## DNS
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.entreessecurisees-alpha-canada-ca-NS will be created
  + resource "aws_route53_record" "entreessecurisees-alpha-canada-ca-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "entreessecurisees.alpha.canada.ca"
      + records         = [
          + "ns-cloud-e1.googledomains.com.",
          + "ns-cloud-e2.googledomains.com.",
          + "ns-cloud-e3.googledomains.com.",
          + "ns-cloud-e4.googledomains.com.",
        ]
      + ttl             = 300
      + type            = "NS"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.safeinputs-alpha-canada-ca-NS will be created
  + resource "aws_route53_record" "safeinputs-alpha-canada-ca-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "safeinputs.alpha.canada.ca"
      + records         = [
          + "ns-cloud-e1.googledomains.com.",
          + "ns-cloud-e2.googledomains.com.",
          + "ns-cloud-e3.googledomains.com.",
          + "ns-cloud-e4.googledomains.com.",
        ]
      + ttl             = 300
      + type            = "NS"
      + zone_id         = "Z33C47YI9EN8XL"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
